blog/container-sizes-en.org
#+TITLE: Measuring Haskell Container Sizes
#+DATE: 2019-09-24
#+AUTHOR: Colin
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>

I was recently surprised to discover a big-O time complexity difference in
measuring the size of ~Map~ vs ~HashMap~ through their respective ~size~
functions. This sent me on a journey to double-check the other container types
we commonly use in Haskell, to be sure that I haven't been punishing myself
unawares.

The crux is this: some containers expose a custom ~length~ (or ~size~) function,
while some present ~Foldable.length~ as the canonical measurement tool. In both
camps, some override ~Foldable.length~ with a better implementation, and some
rely on the default. That default is implemented as follows:

#+begin_src haskell
  -- Hurray, foldl'!
  length :: t a -> Int
  length = foldl' (\c _ -> c+1) 0

  -- Wait...
  foldl' :: (b -> a -> b) -> b -> t a -> b
  foldl' f z0 xs = foldr f' id xs z0
    where f' x k z = k $! f z x
#+end_src

For some structures, ~foldr~ is naughty. For others, it isn't. We seek then
definitive answers to these questions:

- What's the best way to measure the size of each container in Haskell?
- In general, can we trust ~Foldable.length~?

* Overview

Legend:

- ~length = size~: Is ~Foldable.length~ defined in terms of a custom ~size~
  function?

| Container  | Custom ~length~  | ~Foldable.length~ | ~length = size~ ? | Notes                         |
|------------+------------------+-------------------+-------------------+-------------------------------|
| ~[]~       | ~O(n)~           | ~O(n)~            | Yes               | Rewrite rules for performance |
| ~NonEmpty~ | ~O(n)~           | ~O(n)~            | *No*              |                               |
| ~Map~      | ~O(1)~           | ~O(1)~            | Yes               | Embedded ~Size~ field         |
| ~IntMap~   | ~O(n)~           | ~O(n)~            | Yes               |                               |
| ~Set~      | ~O(1)~           | ~O(1)~            | Yes               | Embedded ~Size~ field         |
| ~IntSet~   | ~O(n)~           | N/A               | N/A               | No ~Foldable~ instance        |
| ~Seq~      | ~O(1)~           | ~O(1)~            | Yes               | Embedded ~Int~ field          |
| ~Tree~     | N/A              | ~O(n)~            | N/A               | Default ~Foldable~ instance   |
| ~Array~    | ~O(1)~           | ~O(1)~            | Yes               | Embedded ~Int~ field          |
|------------+------------------+-------------------+-------------------+-------------------------------|
| ~HashMap~  | ~O(n)~           | Worse ~O(n)~      | *No*              | Default ~Foldable~ instance   |
| ~HashSet~  | ~O(n)~           | Worse ~O(n)~      | *No*              | Default ~Foldable~ instance   |
|------------+------------------+-------------------+-------------------+-------------------------------|
| ~Vector~   | Amortized ~O(1)~ | Amortized ~O(1)~  | Yes               |                               |
|------------+------------------+-------------------+-------------------+-------------------------------|

* Types

** ~[]~

Perhaps surprisingly, list length is calculated in the way we were all told to
implement it when first learning Haskell:

#+begin_src haskell
  length :: [a] -> Int
  length xs = lenAcc xs 0

  lenAcc :: [a] -> Int -> Int
  lenAcc []     n = n
  lenAcc (_:ys) n = lenAcc ys (n+1)
#+end_src

Although why is there no ~!~ on the ~n~? Futhermore, there are some rewrite
rules that claim to be for performance:

#+begin_src haskell
  {-# RULES
  "length" [~1] forall xs . length xs = foldr lengthFB idLength xs 0
  "lengthList" [1] foldr lengthFB idLength = lenAcc
   #-}

  -- The lambda form turns out to be necessary to make this inline
  -- when we need it to and give good performance.
  {-# INLINE [0] lengthFB #-}
  lengthFB :: x -> (Int -> Int) -> Int -> Int
  lengthFB _ r = \ !a -> r (a + 1)
#+end_src

