blog/container-sizes-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-11 Wed 09:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Measuring Haskell Container Sizes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Measuring Haskell Container Sizes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1be5f2">1. Overview</a>
<ul>
<li><a href="#org7123d32">1.1. <code>[]</code></a></li>
<li><a href="#orgeb20ccc">1.2. <code>NonEmpty</code></a></li>
<li><a href="#org897eedc">1.3. <code>Map</code></a></li>
<li><a href="#orga2f0123">1.4. <code>Set</code></a></li>
<li><a href="#orgf94cf82">1.5. <code>Seq</code></a></li>
<li><a href="#org36a1a64">1.6. <code>Tree</code></a></li>
<li><a href="#orgf08503d">1.7. <code>Array</code></a></li>
<li><a href="#org1a97f93">1.8. <code>HashMap</code></a></li>
<li><a href="#orgf7f61aa">1.9. <code>HashSet</code></a></li>
<li><a href="#orgf7627b6">1.10. <code>Vector</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I was recently surprised to discover a big-O time complexity difference in
measuring the size of <code>Map</code> vs <code>HashMap</code> through their respective <code>size</code>
functions. This sent me on a journey to double-check the other container types
we commonly use in Haskell, to be sure that I haven't been punishing myself
unawares.
</p>

<p>
The crux is this: some containers expose a custom <code>length</code> (or <code>size</code>) function,
while some present <code>Foldable.length</code> as the canonical measurement tool. In both
camps, some override <code>Foldable.length</code> with a better implementation, and some
rely on the default. That default is implemented as follows:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Hurray, foldl'!</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> t a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">=</span> foldl' <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>c <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">-&gt;</span> c<span style="color: #715ab1;">+</span><span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> <span style="color: #4e3163;">0</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Wait...</span>
<span style="color: #6c3163; font-weight: bold;">foldl'</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>b <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> b <span style="color: #715ab1;">-&gt;</span> t a <span style="color: #715ab1;">-&gt;</span> b
<span style="color: #6c3163; font-weight: bold;">foldl'</span> f z0 xs <span style="color: #715ab1;">=</span> foldr f' id xs z0
  <span style="color: #3a81c3; font-weight: bold;">where</span> f' x k z <span style="color: #715ab1;">=</span> k <span style="color: #715ab1;">$!</span> f z x
</pre>
</div>

<p>
For some structures, <code>foldr</code> is naughty. For others, it isn't. We seek then
definitive answers to these questions:
</p>

<ul class="org-ul">
<li>What's the best way to measure the size of each container in Haskell?</li>
<li>In general, can we trust <code>Foldable.length</code>?</li>
</ul>

<div id="outline-container-orgc1be5f2" class="outline-2">
<h2 id="orgc1be5f2"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Legend:
</p>

<ul class="org-ul">
<li><code>length = size</code>: Is <code>Foldable.length</code> defined in terms of a custom <code>size</code>
function?</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container</th>
<th scope="col" class="org-left">Custom <code>length</code></th>
<th scope="col" class="org-left"><code>Foldable.length</code></th>
<th scope="col" class="org-left"><code>length = size</code> ?</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[]</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Rewrite rules for performance</td>
</tr>

<tr>
<td class="org-left"><code>NonEmpty</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left"><b>No</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Map</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Embedded <code>Size</code> field</td>
</tr>

<tr>
<td class="org-left"><code>IntMap</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Set</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Embedded <code>Size</code> field</td>
</tr>

<tr>
<td class="org-left"><code>IntSet</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-left">No <code>Foldable</code> instance</td>
</tr>

<tr>
<td class="org-left"><code>Seq</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Embedded <code>Int</code> field</td>
</tr>

<tr>
<td class="org-left"><code>Tree</code></td>
<td class="org-left">N/A</td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">N/A</td>
<td class="org-left">Default <code>Foldable</code> instance</td>
</tr>

<tr>
<td class="org-left"><code>Array</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left"><code>O(1)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">Embedded <code>Int</code> field</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>HashMap</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">Worse <code>O(n)</code></td>
<td class="org-left"><b>No</b></td>
<td class="org-left">Default <code>Foldable</code> instance</td>
</tr>

<tr>
<td class="org-left"><code>HashSet</code></td>
<td class="org-left"><code>O(n)</code></td>
<td class="org-left">Worse <code>O(n)</code></td>
<td class="org-left"><b>No</b></td>
<td class="org-left">Default <code>Foldable</code> instance</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>Vector</code></td>
<td class="org-left">Amortized <code>O(1)</code></td>
<td class="org-left">Amortized <code>O(1)</code></td>
<td class="org-left">Yes</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org7123d32" class="outline-3">
<h3 id="org7123d32"><span class="section-number-3">1.1</span> <code>[]</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Perhaps surprisingly, list length is calculated in the way we were all told to
implement it when first learning Haskell:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> xs <span style="color: #715ab1;">=</span> lenAcc xs <span style="color: #4e3163;">0</span>

<span style="color: #6c3163; font-weight: bold;">lenAcc</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">lenAcc</span> <span style="color: #3a81c3; font-weight: bold;">[]</span>     n <span style="color: #715ab1;">=</span> n
<span style="color: #6c3163; font-weight: bold;">lenAcc</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #ba2f59; font-weight: bold;">:</span>ys<span style="color: #3a81c3;">)</span> n <span style="color: #715ab1;">=</span> lenAcc ys <span style="color: #3a81c3;">(</span>n<span style="color: #715ab1;">+</span><span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Although why is there no <code>!</code> on the <code>n</code>? Futhermore, there are some rewrite
rules that claim to be for performance:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163;">{-# RULES</span>
<span style="color: #6c3163;">"length" [~1] forall xs . length xs = foldr lengthFB idLength xs 0</span>
<span style="color: #6c3163;">"lengthList" [1] foldr lengthFB idLength = lenAcc</span>
<span style="color: #6c3163;"> #-}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The lambda form turns out to be necessary to make this inline</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">when we need it to and give good performance.</span>
<span style="color: #6c3163;">{-# INLINE [0] lengthFB #-}</span>
<span style="color: #6c3163; font-weight: bold;">lengthFB</span> <span style="color: #715ab1;">::</span> x <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">lengthFB</span> <span style="color: #3a81c3; font-weight: bold;">_</span> r <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">\</span> <span style="color: #715ab1;">!</span>a <span style="color: #715ab1;">-&gt;</span> r <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">+</span> <span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
