blog/container-sizes-en.org
** ~NonEmpty~

Not a surprise:

#+begin_src haskell
  length :: NonEmpty a -> Int
  length (_ :| xs) = 1 + Prelude.length xs
#+end_src

But note that its ~Foldable~ instance does not override ~length~! Its default
calls ~foldl'~, which calls ~foldr~, which is overridden as:

#+begin_src haskell
  foldr f z ~(a :| as) = f a (List.foldr f z as)
#+end_src

** ~Map~

~Map~ is defined like this (altered slightly for clarity):

#+begin_src haskell
  data Map k a = Bin Size k a (Map k a) (Map k a) | Tip

  type Size = Int
#+end_src

Calls like ~insert~ alter the ~Size~ field at the same time that they write the
new element. Fetching that ~Size~ couldn't get more ~O(1)~:

#+begin_src haskell
  size :: Map k a -> Int
  size Tip              = 0
  size (Bin sz _ _ _ _) = sz
#+end_src

** ~Set~

~Set~ is not defined in terms of ~Map~ as one might have thought, but it follows
the same idea:

#+begin_src haskell
  data Set a = Bin Size a (Set a) (Set a) | Tip

  type Size = Int
#+end_src

** ~Seq~

~Seq~ is defined as:

#+begin_src haskell
  newtype Seq a = Seq (FingerTree (Elem a))

  data FingerTree a
    = EmptyT
    | Single a
    | Deep Int (Digit a) (FingerTree (Node a)) (Digit a)

  length :: Seq a -> Int
  length (Seq xs) = size xs

  class Sized a where
    size :: a -> Int

  instance Sized a => Sized (FingerTree a) where
      size EmptyT         = 0
      size (Single x)     = size x
      size (Deep v _ _ _) = v
#+end_src

The ~Int~ field of ~Deep~ is the size, which is updated upon every insert /
removal.

** ~Tree~

We don't get much:

#+begin_src haskell
  data Tree a = Node a [Tree a]

  instance Foldable Tree where
    foldMap f (Node x ts) = f x `mappend` foldMap (foldMap f) ts
#+end_src

So this is as "default" as ~Foldable.length~ can get. Recall ~length -> foldl'
-> foldr~, where:

#+begin_src haskell
  foldr :: (a -> b -> b) -> b -> t a -> b
  foldr f z t = appEndo (foldMap (Endo #. f) t) z
#+end_src

** ~Array~

#+begin_src haskell
  data Array i e = Array i i Int (Array# e)

  numElements :: Array i e -> Int
  numElements (Array _ _ n _) = n
  {-# INLINE numElements #-}
#+end_src

Where the ~Int~ is explained to be:

#+begin_example
  A cache of (rangeSize (l,u)) used to make sure an index is really in range.
#+end_example

