blog/container-sizes-en.html

<div id="outline-container-orgeb20ccc" class="outline-3">
<h3 id="orgeb20ccc"><span class="section-number-3">1.2</span> <code>NonEmpty</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Not a surprise:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">NonEmpty</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #ba2f59; font-weight: bold;">:|</span> xs<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> <span style="color: #4e3163;">1</span> <span style="color: #715ab1;">+</span> Prelude.length xs
</pre>
</div>

<p>
But note that its <code>Foldable</code> instance does not override <code>length</code>! Its default
calls <code>foldl'</code>, which calls <code>foldr</code>, which is overridden as:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">foldr</span> f z <span style="color: #715ab1;">~</span><span style="color: #3a81c3;">(</span>a <span style="color: #ba2f59; font-weight: bold;">:|</span> as<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> f a <span style="color: #3a81c3;">(</span>List.foldr f z as<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org897eedc" class="outline-3">
<h3 id="org897eedc"><span class="section-number-3">1.3</span> <code>Map</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>Map</code> is defined like this (altered slightly for clarity):
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Map</span> k a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Bin</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> k a <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Map</span> k a<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Map</span> k a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Tip</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
</pre>
</div>

<p>
Calls like <code>insert</code> alter the <code>Size</code> field at the same time that they write the
new element. Fetching that <code>Size</code> couldn't get more <code>O(1)</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">size</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Map</span> k a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">size</span> <span style="color: #ba2f59; font-weight: bold;">Tip</span>              <span style="color: #715ab1;">=</span> <span style="color: #4e3163;">0</span>
<span style="color: #6c3163; font-weight: bold;">size</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Bin</span> sz <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> sz
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2f0123" class="outline-3">
<h3 id="orga2f0123"><span class="section-number-3">1.4</span> <code>Set</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>Set</code> is not defined in terms of <code>Map</code> as one might have thought, but it follows
the same idea:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Set</span> a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Bin</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> a <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Set</span> a<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Set</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Tip</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf94cf82" class="outline-3">
<h3 id="orgf94cf82"><span class="section-number-3">1.5</span> <code>Seq</code></h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>Seq</code> is defined as:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">newtype</span> <span style="color: #ba2f59; font-weight: bold;">Seq</span> a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Seq</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">FingerTree</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Elem</span> a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">FingerTree</span> a
  <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">EmptyT</span>
  <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Single</span> a
  <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Deep</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Digit</span> a<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">FingerTree</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Node</span> a<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Digit</span> a<span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Seq</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Seq</span> xs<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> size xs

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Sized</span> a <span style="color: #3a81c3; font-weight: bold;">where</span>
  size <span style="color: #715ab1;">::</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>

<span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Sized</span> a <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Sized</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">FingerTree</span> a<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
    size <span style="color: #ba2f59; font-weight: bold;">EmptyT</span>         <span style="color: #715ab1;">=</span> <span style="color: #4e3163;">0</span>
    size <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Single</span> x<span style="color: #3a81c3;">)</span>     <span style="color: #715ab1;">=</span> size x
    size <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Deep</span> v <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> v
</pre>
</div>

<p>
The <code>Int</code> field of <code>Deep</code> is the size, which is updated upon every insert /
removal.
</p>
</div>
</div>

<div id="outline-container-org36a1a64" class="outline-3">
<h3 id="org36a1a64"><span class="section-number-3">1.6</span> <code>Tree</code></h3>
<div class="outline-text-3" id="text-1-6">
<p>
We don't get much:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Tree</span> a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Node</span> a <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Tree</span> a<span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Foldable</span> <span style="color: #ba2f59; font-weight: bold;">Tree</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  foldMap f <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Node</span> x ts<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> f x <span style="color: #715ab1;">`mappend`</span> foldMap <span style="color: #3a81c3;">(</span>foldMap f<span style="color: #3a81c3;">)</span> ts
</pre>
</div>

<p>
So this is as "default" as <code>Foldable.length</code> can get. Recall <code>length -&gt; foldl'
-&gt; foldr</code>, where:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">foldr</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> b <span style="color: #715ab1;">-&gt;</span> t a <span style="color: #715ab1;">-&gt;</span> b
<span style="color: #6c3163; font-weight: bold;">foldr</span> f z t <span style="color: #715ab1;">=</span> appEndo <span style="color: #3a81c3;">(</span>foldMap <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Endo</span> <span style="color: #715ab1;">#.</span> f<span style="color: #6c3163;">)</span> t<span style="color: #3a81c3;">)</span> z
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf08503d" class="outline-3">
<h3 id="orgf08503d"><span class="section-number-3">1.7</span> <code>Array</code></h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Array</span> i e <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Array</span> i i <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array#</span> e<span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">numElements</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Array</span> i e <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">numElements</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span> n <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> n
<span style="color: #6c3163;">{-# INLINE numElements #-}</span>
</pre>
</div>

<p>
Where the <code>Int</code> is explained to be:
</p>

<pre class="example">
A cache of (rangeSize (l,u)) used to make sure an index is really in range.
</pre>
</div>
</div>
