blog/container-sizes-en.org
** ~HashMap~

This type has an interesting story.

#+begin_src haskell
  data HashMap k v
      = Empty
      | BitmapIndexed Bitmap (A.Array (HashMap k v))
      | Leaf Hash (Leaf k v)
      | Full (A.Array (HashMap k v))
      | Collision Hash (A.Array (Leaf k v))
#+end_src

This ~A.Array~ type is defined internally to ~unordered-containers~, but is
based off of ~GHC.Exts.SmallArray#~:

#+begin_src haskell
  data SmallArray# a :: TYPE 'UnliftedRep
#+end_src

With the appearance of GHC magic, I shall tread no deeper. ~SmallArray#~ doesn't
have an embedded size field like the usual ~Data.Array.Array~ does, hence ~O(n)~
for ~HashMap~:

#+begin_src haskell
  size :: HashMap k v -> Int
  size t = go t 0
    where
      go Empty                !n = n
      go (Leaf _ _)            n = n + 1
      go (BitmapIndexed _ ary) n = A.foldl' (flip go) n ary
      go (Full ary)            n = A.foldl' (flip go) n ary
      go (Collision _ ary)     n = n + A.length ary

  --- In `Data.HashMap.Array` ---

  length :: Array a -> Int
  length ary = I# (sizeofArray# (unArray ary))

  sizeofArray# :: SmallArray# a -> Int#
  sizeofArray# = sizeofSmallArray#

  --- In `GHC.Exts` --

  sizeofSmallArray# :: SmallArray# a -> Int#
#+end_src

And what's this? A near-default ~Foldable~ instance?

#+begin_src haskell
  instance Foldable.Foldable (HashMap k) where
    foldr f = foldrWithKey (const f)

  foldrWithKey :: (k -> v -> a -> a) -> a -> HashMap k v -> a
  foldrWithKey f = go
    where
      go z Empty                 = z
      go z (Leaf _ (L k v))      = f k v z
      go z (BitmapIndexed _ ary) = A.foldr (flip go) z ary
      go z (Full ary)            = A.foldr (flip go) z ary
      go z (Collision _ ary)     = A.foldr (\ (L k v) z' -> f k v z') z ary
#+end_src

Notice the strict ~foldl'~ versus ~foldr~.

** ~HashSet~

The smoking gun. This must be why I thought ~Set~ was defined in terms of ~Map~:

#+begin_src haskell
  newtype HashSet a = HashSet (HashMap a ())
#+end_src

I wonder if that redundantly allocates all the ~()~, or if a pointer is shared
internally?

#+begin_src haskell
  instance Foldable.Foldable HashSet where
    foldr = Data.HashSet.Base.foldr

  foldr :: (b -> a -> a) -> a -> HashSet b -> a
  foldr f z0 = foldrWithKey g z0 . asMap
    where g k _ z = f k z
#+end_src

So, entirely based on the performance of ~HashMap~.

