blog/container-sizes-en.html

<div id="outline-container-org1a97f93" class="outline-3">
<h3 id="org1a97f93"><span class="section-number-3">1.8</span> <code>HashMap</code></h3>
<div class="outline-text-3" id="text-1-8">
<p>
This type has an interesting story.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">HashMap</span> k v
    <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Empty</span>
    <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">BitmapIndexed</span> <span style="color: #ba2f59; font-weight: bold;">Bitmap</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">A.Array</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">HashMap</span> k v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Leaf</span> <span style="color: #ba2f59; font-weight: bold;">Hash</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Leaf</span> k v<span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Full</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">A.Array</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">HashMap</span> k v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Collision</span> <span style="color: #ba2f59; font-weight: bold;">Hash</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">A.Array</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Leaf</span> k v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
This <code>A.Array</code> type is defined internally to <code>unordered-containers</code>, but is
based off of <code>GHC.Exts.SmallArray#</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">SmallArray#</span> a <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">TYPE</span> '<span style="color: #ba2f59; font-weight: bold;">UnliftedRep</span>
</pre>
</div>

<p>
With the appearance of GHC magic, I shall tread no deeper. <code>SmallArray#</code> doesn't
have an embedded size field like the usual <code>Data.Array.Array</code> does, hence <code>O(n)</code>
for <code>HashMap</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">size</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">HashMap</span> k v <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">size</span> t <span style="color: #715ab1;">=</span> go t <span style="color: #4e3163;">0</span>
  <span style="color: #3a81c3; font-weight: bold;">where</span>
    go <span style="color: #ba2f59; font-weight: bold;">Empty</span>                <span style="color: #715ab1;">!</span>n <span style="color: #715ab1;">=</span> n
    go <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Leaf</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #3a81c3;">)</span>            n <span style="color: #715ab1;">=</span> n <span style="color: #715ab1;">+</span> <span style="color: #4e3163;">1</span>
    go <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">BitmapIndexed</span> <span style="color: #3a81c3; font-weight: bold;">_</span> ary<span style="color: #3a81c3;">)</span> n <span style="color: #715ab1;">=</span> A.foldl' <span style="color: #3a81c3;">(</span>flip go<span style="color: #3a81c3;">)</span> n ary
    go <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Full</span> ary<span style="color: #3a81c3;">)</span>            n <span style="color: #715ab1;">=</span> A.foldl' <span style="color: #3a81c3;">(</span>flip go<span style="color: #3a81c3;">)</span> n ary
    go <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Collision</span> <span style="color: #3a81c3; font-weight: bold;">_</span> ary<span style="color: #3a81c3;">)</span>     n <span style="color: #715ab1;">=</span> n <span style="color: #715ab1;">+</span> A.length ary

<span style="color: #2aa1ae; background-color: #ecf3ec;">--</span><span style="color: #2aa1ae; background-color: #ecf3ec;">- In `Data.HashMap.Array` ---</span>

<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Array</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> ary <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">I#</span> <span style="color: #3a81c3;">(</span>sizeofArray# <span style="color: #6c3163;">(</span>unArray ary<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

sizeofArray<span style="color: #6c3163; font-weight: bold;">#</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SmallArray#</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int#</span>
sizeofArray<span style="color: #6c3163; font-weight: bold;">#</span> <span style="color: #715ab1;">=</span> sizeofSmallArray#

<span style="color: #2aa1ae; background-color: #ecf3ec;">--</span><span style="color: #2aa1ae; background-color: #ecf3ec;">- In `GHC.Exts` --</span>

sizeofSmallArray<span style="color: #6c3163; font-weight: bold;">#</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SmallArray#</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int#</span>
</pre>
</div>

<p>
And what's this? A near-default <code>Foldable</code> instance?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Foldable.Foldable</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HashMap</span> k<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  foldr f <span style="color: #715ab1;">=</span> foldrWithKey <span style="color: #3a81c3;">(</span>const f<span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">foldrWithKey</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>k <span style="color: #715ab1;">-&gt;</span> v <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">HashMap</span> k v <span style="color: #715ab1;">-&gt;</span> a
<span style="color: #6c3163; font-weight: bold;">foldrWithKey</span> f <span style="color: #715ab1;">=</span> go
  <span style="color: #3a81c3; font-weight: bold;">where</span>
    go z <span style="color: #ba2f59; font-weight: bold;">Empty</span>                 <span style="color: #715ab1;">=</span> z
    go z <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Leaf</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">L</span> k v<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>      <span style="color: #715ab1;">=</span> f k v z
    go z <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">BitmapIndexed</span> <span style="color: #3a81c3; font-weight: bold;">_</span> ary<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> A.foldr <span style="color: #3a81c3;">(</span>flip go<span style="color: #3a81c3;">)</span> z ary
    go z <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Full</span> ary<span style="color: #3a81c3;">)</span>            <span style="color: #715ab1;">=</span> A.foldr <span style="color: #3a81c3;">(</span>flip go<span style="color: #3a81c3;">)</span> z ary
    go z <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Collision</span> <span style="color: #3a81c3; font-weight: bold;">_</span> ary<span style="color: #3a81c3;">)</span>     <span style="color: #715ab1;">=</span> A.foldr <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">L</span> k v<span style="color: #6c3163;">)</span> z' <span style="color: #715ab1;">-&gt;</span> f k v z'<span style="color: #3a81c3;">)</span> z ary
</pre>
</div>

<p>
Notice the strict <code>foldl'</code> versus <code>foldr</code>.
</p>
</div>
</div>

<div id="outline-container-orgf7f61aa" class="outline-3">
<h3 id="orgf7f61aa"><span class="section-number-3">1.9</span> <code>HashSet</code></h3>
<div class="outline-text-3" id="text-1-9">
<p>
The smoking gun. This must be why I thought <code>Set</code> was defined in terms of <code>Map</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">newtype</span> <span style="color: #ba2f59; font-weight: bold;">HashSet</span> a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">HashSet</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HashMap</span> a <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
I wonder if that redundantly allocates all the <code>()</code>, or if a pointer is shared
internally?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Foldable.Foldable</span> <span style="color: #ba2f59; font-weight: bold;">HashSet</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  foldr <span style="color: #715ab1;">=</span> Data.HashSet.Base.foldr

<span style="color: #6c3163; font-weight: bold;">foldr</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>b <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">HashSet</span> b <span style="color: #715ab1;">-&gt;</span> a
<span style="color: #6c3163; font-weight: bold;">foldr</span> f z0 <span style="color: #715ab1;">=</span> foldrWithKey g z0 <span style="color: #715ab1;">.</span> asMap
  <span style="color: #3a81c3; font-weight: bold;">where</span> g k <span style="color: #3a81c3; font-weight: bold;">_</span> z <span style="color: #715ab1;">=</span> f k z
</pre>
</div>

<p>
So, entirely based on the performance of <code>HashMap</code>.
</p>
</div>
</div>
