blog/container-sizes-en.org
** ~Vector~

Crawl down the rabbit hole with me:

#+begin_src haskell
  length :: Vector a -> Int
  length = G.length

  length :: Vector v a => v a -> Int
  length = Bundle.length . stream'

  length :: Bundle v a -> Int
  length = unId . M.length

  length :: Monad m => Bundle m v a -> m Int
  length Bundle{sSize = Exact n} = return n
  length Bundle{sChunks = s}     = S.foldl' (\n (Chunk k _) -> n+k) 0 s

  data Bundle m v a = Bundle
    { sElems  :: Stream m a
    , sChunks :: Stream m (Chunk v a)
    , sVector :: Maybe (v a)
    , sSize   :: Size }

  data Size = Exact Int  -- ^ Exact size
            | Max   Int  -- ^ Upper bound on the size
            | Unknown    -- ^ Unknown size
#+end_src

So ~O(1)~ if dealing with an untouched ~Vector~, but potentially ~O(c)~ had you
done some splitting and twisting which invoked Fusion.
