blog/container-sizes-en.html

<div id="outline-container-orgf7627b6" class="outline-3">
<h3 id="orgf7627b6"><span class="section-number-3">1.10</span> <code>Vector</code></h3>
<div class="outline-text-3" id="text-1-10">
<p>
Crawl down the rabbit hole with me:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Vector</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">=</span> G.length

<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Vector</span> v a <span style="color: #715ab1;">=&gt;</span> v a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">=</span> Bundle.length <span style="color: #715ab1;">.</span> stream'

<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span> v a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">=</span> unId <span style="color: #715ab1;">.</span> M.length

<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Monad</span> m <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span> m v a <span style="color: #715ab1;">-&gt;</span> m <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span><span style="color: #3a81c3;">{</span>sSize <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Exact</span> n<span style="color: #3a81c3;">}</span> <span style="color: #715ab1;">=</span> return n
<span style="color: #6c3163; font-weight: bold;">length</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span><span style="color: #3a81c3;">{</span>sChunks <span style="color: #715ab1;">=</span> s<span style="color: #3a81c3;">}</span>     <span style="color: #715ab1;">=</span> S.foldl' <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>n <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Chunk</span> k <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #6c3163;">)</span> <span style="color: #715ab1;">-&gt;</span> n<span style="color: #715ab1;">+</span>k<span style="color: #3a81c3;">)</span> <span style="color: #4e3163;">0</span> s

<span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span> m v a <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Bundle</span>
  <span style="color: #3a81c3;">{</span> sElems  <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Stream</span> m a
  , sChunks <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Stream</span> m <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Chunk</span> v a<span style="color: #6c3163;">)</span>
  , sVector <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #6c3163;">(</span>v a<span style="color: #6c3163;">)</span>
  , sSize   <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> <span style="color: #3a81c3;">}</span>

<span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Size</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Exact</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>  <span style="color: #da8b55;">-- ^ Exact size</span>
          <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Max</span>   <span style="color: #ba2f59; font-weight: bold;">Int</span>  <span style="color: #da8b55;">-- ^ Upper bound on the size</span>
          <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Unknown</span>    <span style="color: #da8b55;">-- ^ Unknown size</span>
</pre>
</div>

<p>
So <code>O(1)</code> if dealing with an untouched <code>Vector</code>, but potentially <code>O(c)</code> had you
done some splitting and twisting which invoked Fusion.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-09-24</p>
<p class="author">Author: Colin</p>
<p class="date">Created: 2019-12-11 Wed 09:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
